Repository: common-repository/allpay-payment-gateway
Catalog: languages/allpay-payment-gateway-*.po
Languages: he_il

source: Allpay payment gateway
he_il: שער תשלום של Allpay

source: Allpay Payment Gateway for WooCommerce.
he_il: שער תשלום של Allpay לWooCommerce.

source: Settings
he_il: הגדרות

source: Bank cards payments Allpay
he_il: תשלום בכרטיסי בנק דרך Allpay

source: Allpay Payment Gateway Plug-in for WooCommerce
he_il: פלאגין שער תשלום של Allpay עבור WooCommerce

source: Enable / Disable
he_il: להפעיל / לכבות

source: Enable this payment gateway
he_il: הפעל את אמצעי התשלום הזה

source: Title
he_il: כותרת

source: Payment title the customer will see during the checkout process.
he_il: כותרת התשלום שהקונה יראה בעת ביצוע ההזמנה.

source: Credit card
he_il: כרטיס אשראי

source: Description
he_il: תיאור

source: Payment description the customer will see during the checkout process.
he_il: תיאור התשלום שיראה הקונה בעת ביצוע ההזמנה.

source: Pay securely using your credit card.
he_il: שלם בצורה מאובטחת עם כרטיס האשראי שלך.

source: API login
he_il: שם משתמש API

source: Allpay API Login
he_il: שם משתמש API בAllpay

source: API key
he_il: מפתח API

source: Allpay API Key
he_il: מפתח API בAllpay

source: Installment max payments
he_il: תשלומים מקסימליים

source: Maximum number of installment payments. Up to 12, zero to disable.
he_il: מספר מקסימלי של תשלומים. עד 12, אפס כדי להשבית.

source: Allows client to choose number of payments. Valid for credit cards only (no debit cards)
he_il: מאפשר ללקוח לבחור מספר תשלומים. עובד עבור כרטיסי אשראי בלבד (ללא כרטיסי דיירכט)

source: Installment min order amount
he_il: סכום הזמנה מינימלי בתשלומים

source: Minimum order amount for installments. Zero for orders of any amount.
he_il: מינימום הזמנה בתשלומים. אפס עבור הזמנות בכל סכום.

source: Enables installment option when payment amount equals or above this value
he_il: מפעיל את אפשרות התשלומים כאשר סכום התשלום שווה או גדול מערך זה

source: First payment amount
he_il: סכום התשלום הראשון

source: First Installment payment. Zero for auto.
he_il: סכום התשלום הראשון. אפס לחישוב אוטומטי.

source: Makes first payment amount fixed. If set to 0, the system will calculate the first payment
he_il: קובע את סכום התשלום הראשון. אם מוגדר ל-0, המערכת תחשב את התשלום הראשון

source: We are currently experiencing problems trying to connect to this payment gateway. Sorry for the inconvenience.
he_il: אנו נתקלים כעת בבעיות בניסיון להתחבר לשער תשלום זה.אנו מצטערים על אי הנוחות.

source: Allpay's Response was empty.
he_il: תגובה ריקה משער התשלום.
